wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
	}	

}	


static void modules_enable(bool erase_bonds)
{

  if(m_protocol_mode == M_COMS_BLE_MODE)
	{	
	
		m_coms_ble_enable(erase_bonds);
		 NRF_LOG_INFO("BLE mode start.");
	}	
	else
	{				
	   m_coms_gzll_enable(erase_bonds);
		 m_coms_gzll_search_for_host();
     NRF_LOG_INFO("GZLL mode start.");		
	}	
		
}

static void protocol_det_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	uint8_t level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
	uint8_t is_softdevice_enabled;
	
  if (pin == PROTOCOL_DETECT_PIN)
	{
	
    NRF_LOG_INFO("Reset!!");
	
    nrf_delay_ms(100);
		
		sd_softdevice_is_enabled(&is_softdevice_enabled);
		
		if (is_softdevice_enabled==1)
		{	
		  sd_nvic_SystemReset();
		}
		else
		{
      NVIC_SystemReset();
    }			

  }		
	
	
}	




/**@brief Initialization of unused I/Os
 */
static void misc_io_init(void)
{
    ret_code_t err_code; 
	  int i;
    uint32_t unused_pins[] = {0, 1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 26, 27, 28, 29, 30, 31};  
    uint8_t  level;   

    for (i = 0; i < (sizeof(unused_pins) / sizeof(unused_pins[0])); ++i)
    {
        uint32_t pin = unused_pins[i];
        
        NRF_GPIO->PIN_CNF[pin] =
            (GPIO_PIN_CNF_DIR_Input        << GPIO_PIN_CNF_DIR_Pos)    |
            (GPIO_PIN_CNF_INPUT_Disconnect << GPIO_PIN_CNF_INPUT_Pos)  |
            (GPIO_PIN_CNF_PULL_Disabled    << GPIO_PIN_CNF_PULL_Pos)   |
            (GPIO_PIN_CNF_DRIVE_S0S1       << GPIO_PIN_CNF_DRIVE_Pos)  |
            (GPIO_PIN_CNF_SENSE_Disabled   << GPIO_PIN_CNF_SENSE_Pos);           
    }     
		
				//Set P0.03 as a protocol detect input pin, default GZLL, GND to BLE
		   NRF_GPIO->PIN_CNF[PROTOCOL_DETECT_PIN] =
		        (GPIO_PIN_CNF_DIR_Input        << GPIO_PIN_CNF_DIR_Pos)    |
            (GPIO_PIN_CNF_INPUT_Connect    << GPIO_PIN_CNF_INPUT_Pos)  |
            (GPIO_PIN_CNF_PULL_Pullup      << GPIO_PIN_CNF_PULL_Pos)   |
            (GPIO_PIN_CNF_DRIVE_S0S1       << GPIO_PIN_CNF_DRIVE_Pos)  |
            (GPIO_PIN_CNF_SENSE_Disabled   << GPIO_PIN_CNF_SENSE_Pos);
		
		level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
		
		if (!nrf_drv_gpiote_is_init())
    {
		   err_code = nrf_drv_gpiote_init();
       APP_ERROR_CHECK(err_code);
		}
		//Set P0.03 as a protocol detect input pin, VDD to GZLL, GND to BLE
		memset(&protocol_detect_pin_cfg, 0, sizeof(protocol_detect_pin_cfg));
		protocol_detect_pin_cfg.hi_accuracy = true;
	  
		protocol_detect_pin_cfg.sense = (level==M_COMS_BLE_MODE)? NRF_GPIOTE_POLARITY_LOTOHI : NRF_GPIOTE_POLARITY_HITOLO  ;
		protocol_detect_pin_cfg.pull  = (level==M_COMS_BLE_MODE)? NRF_GPIO_PIN_PULLDOWN : NRF_GPIO_PIN_PULLUP ;
		
		NRF_LOG_INFO("protocol detect pin toggled, level = %d", nrf_gpio_pin_read(PROTOCOL_DETECT_PIN) );
		
		err_code = nrf_drv_gpiote_in_init(PROTOCOL_DETECT_PIN, &protocol_detect_pin_cfg, protocol_det_pin_handler);
		APP_ERROR_CHECK(err_code);
		
		nrf_drv_gpiote_in_event_enable(PROTOCOL_DETECT_PIN, true);
	
}			


/************************************* wright : add keyboard function **************************************/


/**@brief Handler function for keyboard module events
 */
//wright : for mode selection

static uint8_t KEY_CODE_BLE_MODE = 0xAA;
static uint8_t KEY_CODE_GARZLL_MODE = 0xAB;
bool IS_KEY_CODE_MODE_PRESSED = false;


static void m_keyboard_handler(void * p_event_data, uint16_t event_size)
{
    uint32_t            err_code;
    m_keyboard_data_t * keyboard_pkt;
    
    ASSERT(event_size == sizeof(m_keyboard_data_t));
    
    keyboard_pkt = (m_keyboard_data_t *) p_event_data;
	

		NRF_LOG_INFO("---Enter m_keyboard_handler!---");

	
		if (keyboard_pkt->pairing_button)
    {
			//do nothing
		}
		else
		{
				//if user pressed mode change btn combo (fn+1;fn+2)
				//0.stop polling	
				//1.delete mode data 
				//2.write mode data to flash 
				//3.reset 
				if(keyboard_pkt->keys[0] == KEY_CODE_BLE_MODE)
				{
					NRF_LOG_INFO("---PRESS KEY_CODE_BLE_MODE !---");
					IS_KEY_CODE_MODE_PRESSED = true;
					current_transmit_mode_data[0] = M_COMS_BLE_MODE;
				}
					
				
				if(keyboard_pkt->keys[0] == KEY_CODE_GARZLL_MODE)	
				{
					NRF_LOG_INFO("---PRESS KEY_CODE_GARZLL_MODE !---");
					IS_KEY_CODE_MODE_PRESSED = true;
					current_transmit_mode_data[0] = M_COMS_GZLL_MODE;
				}
						
			
				//wright : 
				// start to update mode data under these conditions 
				// 1.mode change key has pressed 
				// 2.Keyboard was released
				if(
						!fds_is_start&&
						m_keyboard_packet_is_empty(keyboard_pkt)&&
						IS_KEY_CODE_MODE_PRESSED
					)
					{
						

						fds_is_start = true;
						m_keyboard_polling_disable();
						NRF_LOG_INFO("---KEY_CODE_MODE_PRESSED & Released!---");
						mode_record_update(current_transmit_mode_data[0]);
						while(fds_busy_flag==true){idle_state_handle();}

					}


				keys_send_fix(keyboard_pkt->num_keys,keyboard_pkt->keys,keyboard_pkt->modifier_keys);
				
		}

    m_pwr_mgmt_feed();
}





void keyboard_module_enable(void)
{
    uint32_t err_code;

	
    err_code = m_keyboard_init(keyboard_format_usbhid, m_keyboard_handler);    
    APP_ERROR_CHECK(err_code); 
    m_keyboard_matrix_enable();
	
	return;


}


/************************************* wright : add keyboard function end**************************************/








//wright : get current mode (ble/gazll) for power manager module
bool get_current_mode()
{
    return m_protocol_mode;
}







/********************************* wright : FDS part ******************************/



static void fds_evt_handler(fds_evt_t const * p_evt)
{
    switch (p_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_INIT Success:");
                m_fds_initialized = true;
            }
            break;

        case FDS_EVT_WRITE:
        {
            if (p_evt->result == FDS_SUCCESS)
            {		
								NRF_LOG_INFO("FDS_EVT_WRITE Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->write.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->write.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->write.record_key);
								fds_busy_flag = false;
            }
        } break;

        case FDS_EVT_DEL_RECORD:
        {
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_DEL_RECORD Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
								fds_busy_flag = false;
            }
        } break;
				
				case FDS_EVT_UPDATE:
				{
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_UPDATE Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
								fds_busy_flag = false;
								//wright: 0418
								NRF_LOG_INFO("====Read file data after \"FDS_EVT_UPDATE Success:\"====");
								//mode_record_read();
            }
        } break;

        default:
            break;
    }
}



static ret_code_t mode_record_delete(void)
{
		fds_busy_flag = true;
    fds_find_token_t tok   = {0};
    fds_record_desc_t desc = {0};
		ret_code_t rc = REC_DEFAULT_VALUE;

    if (fds_record_find(LAST_TRANSMIT_MODE_FILE_ID, LAST_TRANSMIT_MODE_RECORD_KEY, &desc, &tok) == FDS_SUCCESS)
    {
        rc = fds_record_delete(&desc);
        if (rc != FDS_SUCCESS)
        {
						NRF_LOG_INFO("error: fds_record_delete %x",rc);

