wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
            return rc;
        }

//        NRF_LOG_INFO("SUCCESS: fds_record_delete -- fid = %X,  rk= %X ",
//				LAST_TRANSMIT_MODE_FILE_ID,
//				LAST_TRANSMIT_MODE_RECORD_KEY);
    }
    else
    {
        NRF_LOG_INFO("record not found!\r\n");
				rc = DELETE_RECORD_NOT_FOUND;
				fds_busy_flag = false;
    }
		
		return rc;
}

static ret_code_t mode_record_write(uint32_t mode_value)
{
		fds_busy_flag = true;
    fds_record_t const rec =
    {
        .file_id           = LAST_TRANSMIT_MODE_FILE_ID,
        .key               = LAST_TRANSMIT_MODE_RECORD_KEY,
        .data.p_data       = &mode_value,
        .data.length_words = 1
    };


    ret_code_t rc = fds_record_write(NULL, &rec);
    if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_write failed... error code %d",rc);
    }
		return rc;
}

static ret_code_t mode_record_update(uint32_t mode_value)
{
		//record find
		fds_record_desc_t desc = {0};
		fds_find_token_t  tok  = {0};
		ret_code_t rc;
		fds_flash_record_t frec = {0};
			
		rc=fds_record_find(LAST_TRANSMIT_MODE_FILE_ID,LAST_TRANSMIT_MODE_RECORD_KEY,&desc,&tok);
	
		if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_find failed... error code %d",rc);
			return rc;
    }
		
		
		//record update
		fds_busy_flag = true;
    fds_record_t const rec =
    {
        .file_id           = LAST_TRANSMIT_MODE_FILE_ID,
        .key               = LAST_TRANSMIT_MODE_RECORD_KEY,
        .data.p_data       = &mode_value,
        .data.length_words = 1//(2 + 3) / sizeof(uint32_t)
    };
		
		
		NRF_LOG_INFO("==== mode data before update ==== : %d",mode_value);
	
		rc = fds_record_update(&desc, &rec);
		
    if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_update failed... error code %d",rc);
			return rc;
    }
		
		
		return rc;
}




static ret_code_t mode_record_read(void)
{

    fds_record_desc_t desc = {0};
    fds_find_token_t  tok  = {0};
		ret_code_t rc;
		fds_flash_record_t frec = {0};
		//uint32_t data_read[1] ={0};
			
		rc=fds_record_find(LAST_TRANSMIT_MODE_FILE_ID,LAST_TRANSMIT_MODE_RECORD_KEY,&desc,&tok);
		

		
		if (rc == FDS_SUCCESS)
		{
				rc = fds_record_open(&desc, &frec);
				if(rc == FDS_SUCCESS)
				{
					current_transmit_mode_data[0] = *(uint32_t *)frec.p_data; 
					NRF_LOG_INFO("Hex dump the contents of p_data\n");
					NRF_LOG_HEXDUMP_INFO(frec.p_data, 4);
					NRF_LOG_INFO("current_transmit_mode_data = %x",current_transmit_mode_data[0]);
					rc = fds_record_close(&desc);			
				}
				else
				{
					NRF_LOG_INFO("open failed!");
				}
			
		}
		//wright : if file not find, create one (Default mode).
		else if (rc == FDS_ERR_NOT_FOUND)
		{
			NRF_LOG_INFO("record not found! , write Default mode into flash...");
			mode_record_write(M_COMS_GZLL_MODE);
		}

		
		return rc;
}


/**@brief   Wait for fds to initialize. */
static void wait_for_fds_ready(void)
{
    while (!m_fds_initialized)
    {
        idle_state_handle();
    }
}





//wright: mode selection 

bool mode_selection()
{
		


	
		bool mode_result;
		ret_code_t ret;

		/* Register first to receive an event when initialization is complete. */
		(void) fds_register(fds_evt_handler);
	
		ret = fds_init();
		wait_for_fds_ready();


		NRF_LOG_INFO("--- record read ---");
		ret = mode_record_read();
		while(fds_busy_flag==true){idle_state_handle();}

		
		//decide transmit mode
		mode_result =(current_transmit_mode_data[0] == DEFAULT_TRANSMIT_MODE) ;
		
		
		
		
		return mode_result;
}
/********************************* wright : FDS part end ******************************/







/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;  

    // Initialize.
    log_init();

   // misc_io_init();    //For protocol mode setting & unused pins	
	
	
		//wright : Mode selection
		mode_selection();
//		m_protocol_mode = 
//		((mode_selection())?M_COMS_GZLL_MODE:M_COMS_BLE_MODE) ;

    m_protocol_mode = M_COMS_GZLL_MODE;//((nrf_gpio_pin_read(PROTOCOL_DETECT_PIN) == 0)?M_COMS_BLE_MODE:M_COMS_GZLL_MODE) ;

    timers_init();	

    scheduler_init();
		
		//wright : fix for not to infect GPIO output
    //buttons_leds_init(&erase_bonds);

    modules_init();

    NRF_LOG_INFO("Dual mode keyboard example started.");

    modules_enable(erase_bonds);

    application_timers_start();
		
		

    //wright : enable keyboard module.
    keyboard_module_enable();

   

    // Enter main loop.
    for (;;)
    {
    idle_state_handle();
    }
}



















